app/controllers/admin/events_controller.rb

  def index
    @unvalidatedevent = []
    Event.all.each do |event|
---
SELECT "events".* FROM "events"

  def create
    @event = Event.find(params["format"])
    @event.validation = true
    @event.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "events" SET "validation" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["validation", true], ["updated_at", "2019-02-15 14:10:50.220023"], ["id", 8]]