app/controllers/admin/users_controller.rb

  def destroy
    @user = User.find(params[:id])

        if Event.exists?(admin: @user)
          Event.find_by(admin: @user).destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 2]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]