app/controllers/avatars_controller.rb

  def create
    @user = User.find(params["user_id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]