app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    @event = Event.all

INSERT INTO "events" ("admin_id", "start_date", "duration", "title", "description", "price", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    puts params
    duration = params["duration"].to_i
    price = params["price"].to_i
     @event = Event.new(start_date: params["start_date"], duration: duration, title: params["title"], description: params["description"], price: price, location: params["description"])
     @event.admin = current_user
     @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "events" SET "title" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["title", "rdfghjkl!!!!!!"], ["updated_at", "2019-02-13 14:13:43.917728"], ["id", 7]]
---
  def update
    puts params
    @event = Event.find(params[:id])
    eventparams = params.require(:event).permit(:start_date, :duration, :title, :description, :price, :location)
    duration = eventparams["duration"].to_i
    price = eventparams["price"].to_i
     @event.update(start_date: eventparams["start_date"], duration: duration, title: eventparams["title"], description: eventparams["description"], price: price, location: eventparams["description"])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def same_id
    event = Event.find(params[:id])