app/controllers/participations_controller.rb

  def index
    @event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    if already_participating?
      flash[:danger] = "You are already participating"
    else
      puts params
      attendee = User.find(current_user[:id])
      event = Event.find(params[:event_id])
      a = Attendance.create(attendee: attendee, event: event)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "attendances" ("attendee_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["attendee_id", 11], ["event_id", 6], ["created_at", "2019-02-13 12:24:35.433362"], ["updated_at", "2019-02-13 12:24:35.433362"]]

  def already_participating?
   Attendance.where(attendee_id: current_user[:id], event_id: params[:event_id]).exists?
---
SELECT  1 AS one FROM "attendances" WHERE "attendances"."attendee_id" = $1 AND "attendances"."event_id" = $2 LIMIT $3  [["attendee_id", 11], ["event_id", 2], ["LIMIT", 1]]

   def no_admin
     event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def same_id
    event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]