app/controllers/participations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "attendances" ("attendee_id", "event_id", "stripe_customer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["attendee_id", 11], ["event_id", 8], ["stripe_customer_id", "cus_EWTiDnZ9hv22BW"], ["created_at", "2019-02-13 16:38:23.640635"], ["updated_at", "2019-02-13 16:38:23.640635"]]
---
  def create
    if already_participating?
      flash[:danger] = "You are already participating"

    else
    # Amount in cents
    @event = Event.find(params[:event_id])
    @amount = @event.price * 100

    customer = Stripe::Customer.create(
      :email => params[:stripeEmail],
      :source  => params[:stripeToken]
    )

    charge = Stripe::Charge.create(
      :customer    => customer.id,
      :amount      => @amount,
      :description => 'Rails Stripe customer',
      :currency    => 'eur'
    )

    puts params
    attendee = User.find(current_user[:id])
    event = Event.find(params[:event_id])
    a = Attendance.create(attendee: attendee, event: event, stripe_customer_id: customer.id)

SELECT  1 AS one FROM "attendances" WHERE "attendances"."attendee_id" = $1 AND "attendances"."event_id" = $2 LIMIT $3  [["attendee_id", 11], ["event_id", 2], ["LIMIT", 1]]
---
  def already_participating?
   Attendance.where(attendee_id: current_user[:id], event_id: params[:event_id]).exists?

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def same_id
    event = Event.find(params[:event_id])